{
    "personalDetails": {
        "fullName": "Talal Alamdar",
        "email": "talalalamdar@gmail.com",
        "phone": "+31-624-838866",
        "profilePic": "../assets/profilePic-2.jpeg",
        "position": "Front-End Developer",
        "location": "Amsterdam, The Netherlands",
        "linkedIn": {
            "icon": "../assets/Linkedin.png",
            "href": "https://www.linkedin.com/in/talal-alamdar-391204162/"
        },
        "github": {
            "icon": "../assets/GitHub-Mark.png",
            "href": "https://www.github.com/talalalamdar-2"
        }
    },
    "summary": "I am a Software Developer, looking forward to gain more experience and continue building my career in this field. I am very eager to learn, ready to take on responsibilities to improve my skills and add value to your organization. In addition, I function very well within a team and I can also execute tasks on an individual basis when needed. ",
    "education": {
        "hackYourFuture": {
            "startDate": "2017",
            "endDate": "2018",
            "title": "Hack Your Future – Programming school",
            "subTitle": "",
            "details": "HackYourFuture is a coding and programming school. Over the course of six months, professional developers teach HTML, CSS, JavaScript, Node, ReactJs, and MySQL. In addition, problem-solving skills and teamwork are emphasized throughout the curriculum. In the last six weeks, students build a final project to put into practice what they have learned. Project: Hyfer"
        },
        "economics": {
            "startDate": "2009",
            "endDate": "2013",
            "title": "University of Aleppo - Economics",
            "subTitle": "Accounting and Banking"
        }
    },
    "experiences": {
        "TomTom": {
            "startDate": "2021",
            "endDate": "today",
            "title": "TomTom - Amsterdam",
            "subTitle": "Software Engineer",
            "tasks": [
                "Building new applications from scratch using technologies like NextJs, React, TypeScript and Tailwind",
                "Migrating multiple custom legacy applications to NextJs framework",
                "Migrating multiple applications from old CMS to new CMS system",
                "Building new components designed in Figma using technologies like React, Typescript and Tailwind",
                "Creating new forms as reusable components, and integrating it with new system (Hubspot)",
                "Working with Algolia to optimise the search functionality across application",
                "Working with Microsoft Azure to manage pipelines and builds and different deployments of the applications",
                "Writing Cypress and unit tests for different flows and functionalities in the applications",
                "Integrating different third party systems (API) and SDKs",
                "Implementing Google Analytics Tracking (GA4) for different components and events through the apps"
            ],
            "details": "TomTom is a tech company that provides different services (softwares and hardwares) related to location and traffic information and many other products. As a Software Engineer, I worked in the marketing department, my team and I were responsible mainly on developing multiple websites and web applications that uses different internal and external APIs and and third party services. During my work there I took the lead of some projects and my tasks can be summarised with:"
        },
        "Channable": {
            "startDate": "2021",
            "endDate": "2021",
            "title": "Channable - Amsterdam",
            "subTitle": "Front-End Developer",
            "tasks": [
                "Building new pages and components for the website, using technologies like React and GraphQl on the client- side, with Nextjs on the server-side and following a design system built with Styled-Components and following CDD methodology with reusable components.",
                "Managing the website content using GraphCMS, and building new models and define apis structure that can be fetched and queried using Graphql-Apollo on the client side.",
                "Working closely with stakeholders like marketing and support teams to build features that helps them, taking into account the best user experience, interactivity, scalability and making sure it’s mobile friendly.",
                "Code reviews, Hackathons and knowledge sharing sessions.",
                "Writing unit tests for components, using Test Library and Jest.",
                "Writing documentation for features an components using tools like Storybook and Docusaurus.",
                "Fixing bugs, and making sure the application and the website always up running with no issues",
                "Enhancing the developer experience with maintaining the pipelines in git, and build processes with CI.",
                "Enhancing the UI, pixel perfecting it and make sure my work is responsive and compatible with different browsers",
                "Designing new features or re-design already existing components using tools like Figma."
            ],
            "details": "Channable is a marketing company, it provides a tool for feed management and PPC. As a Front-end Developer, I worked on their new website, by building new features, pages and reusable components. The site is statically rendered using NextJs on the server side, on the client side we used technologies like React, GraphQl, Styled-Components, Storybook, and using GrpahCMS to manage the content, we managed the builds and the environments through Vercel as hosting provider. Beside working on the website, I also did some work to the Channable tool. Which is a web app (SPA), built with EmberJs. Was working mainly on integration setup to start migrating the ember pages/components to technologies like React, which was successfully achieved and we built multiple pages and components, and building new design system from scratch for the new react app. My daily tasks:"
        },
        "OneFit": {
            "startDate": "2019",
            "endDate": "2021",
            "title": "OneFit - Amsterdam",
            "subTitle": "Front-End Developer",
            "tasks": [
                "Shipping new features using technologies like vanilla Javascript and VueJs",
                "Feature ownership, making sure features are tested/QA'ed deployed to Production",
                "Working closely with Backend engineers to deliver End to End features",
                "Refactoring and designing some legacy pages",
                "Fixing bugs and making sure the application perform its best",
                "Enhancing the UI, pixel perfecting it and make sure my work is responsive and compatible with different browsers",
                "Code reviews, and knowledge sharing sessions"
            ],
            "details": "OneFit is a platform that help members enjoy doing sports in different gyms and studios across the city, with different types of memberships that it offers to members. As a Front-End Developer, I worked mainly on the Website as well as different products and applications, like Partner Portal and the Admin tool. Working closely with designers and product managers, I worked mainly on below tasks:"
        },
        "Ilumy": {
            "startDate": "2018",
            "endDate": "2019",
            "title": "Ilumy - Amsterdam",
            "subTitle": "Front-End Developer",
            "tasks": [
                "Implementing fully new features for the app",
                "Converting some old code components from AngularJs to ReactJs",
                "Maintaining the platform",
                "Designing multiple parts of it",
                "Fixing different kind of bugs and code reviews",
                "Creating tools that enhance User Experience of the app in any browser"
            ],
            "details": "Ilumy is a company which mainly prototypes new features for different clients. One of the most successful products we have is Plek. It is platform to organize teams and departments within organizations (digital workspace for teams). As a Junior Front-End Developer, I worked mainly on below tasks: "
        }
    },
    "languages": {
        "turkish": {
            "name": "Turkish",
            "level": "Elementary"
        },
        "dutch": {
            "name": "Dutch",
            "level": "Intermediate"
        },
        "english": {
            "name": "English",
            "level": "Advanced"
        },
        "arabic": {
            "name": "Arabic",
            "level": "Native"
        }
    },
    "technicalSkills": [
        "Strong programming skills in: HTML, CSS/Sass, Typescript and JavaScript.",
        "Good working experience with different frameworks and libraries: NextJs, Nuxt, Laravel, React.js, ReactNative, Vue.js, AngularJS, Tailwind, Redux, Jotai, React-tesing-library, Storybook, Styled-Components, Mobx, Vuex, GrpahQl, Apollo, and Rest APIs.",
        "Good working experience with Node.Js, MySQL, Algolia, Docker, MongoDB, Mongoose, Express.js, Jenkins, Vercel, AzureDevops, Figma, SocketIo and Git",
        "Good working experience with different content management systems like GraphCMS and Storyblok.",
        "Good understanding of Scrum and Agile methodology.",
        "Experience with different debugging tools."
    ],
    "sections": [
        "Personal Details",
        "Summary",
        "Education",
        "Experiences",
        "Languages",
        "Technical Skills",
        "Projects"
    ],
    "projects": {
        "moviesApp": {
            "name": "Movies App",
            "description": "Movies App fetching data from The Movie DB API, Search movies from The Movie DB API, Bookmark, Add to plan, Rate a movie and see its average rating, reviews and similar movies. Trending, Latest, Upcoming, Now Playing, and top rated movies. Built using HTML, CSS, javaScript, ReactJs, Redux, React-router, Bootstrap, and Restful API and other libraries",
            "link": "https://talalalamdar-movies-app.surge.sh",
            "sourceCode": "https://github.com/talalalamdar/movies-app"
        },
        "booksApp": {
            "name": "Books App",
            "description": "Books App fetching data from Google Books API: (Search books from Google Books api, Bookmark, preview book, add to plan, or reading list). Built using HTML, CSS, JavaScript, ReactJs, Redux, React-router, Bootstrap, and Restful API",
            "link": "https://talalalamdar-books-app.surge.sh",
            "sourceCode": "https://github.com/talalalamdar/books-app"
        },
        "FlappyBird": {
            "name": "Flappy Bird",
            "description": "Flappy Bird game for web, made with HTML, CSS, and Vanilla Javascript",
            "link": "https://flappy-bird-web.on.fleek.co",
            "sourceCode": "https://github.com/talalalamdar/calculator-react-native"
        },
        "calendar": {
            "name": "Calendar",
            "description": "Simple calendar UI (Add, edit, and remove tasks). Built using HTML, CSS, JavaScript, ReactJs, moment.js, Bootstrap",
            "link": "https://talalalamdar-calendar.surge.sh",
            "sourceCode": "https://github.com/talalalamdar/calendar-react"
        },
        "Chat app": {
            "name": "Chat app",
            "description": "Chat App built with NodeJs, Express, Socket.io, Vuejs, Javascript, Sass - Simple chat interface with rooms and some functionalities interface with 3 screens: - Sign up with userName - Select a room - start chatting with people in the room",
            "link": "",
            "sourceCode": "https://github.com/talalalamdar/Chat-App"
        },
        "meetingsApp": {
            "name": "Meetings App",
            "description": "Meetings app, built using HTML, CSS, JavaScript, ReactJs, NodeJs, MongoDb, Mongoose, Express, and Typescript.",
            "link": "",
            "sourceCode": "https://github.com/talalalamdar/meetings-app"
        },
        "calculator": {
            "name": "Calculator",
            "description": "Simple calculator UI (Mobile App). Built using JavaScript and ReactNative",
            "link": "",
            "sourceCode": "https://github.com/talalalamdar/calculator-react-native"
        },
        "hyfer": {
            "name": "HYFER",
            "description": "Hyfer is an application where all HackYourFuture students can follow their course schedule and find an overview of their homework. It also provides insight for teachers, to verify which modules are taught. Finally, students can receive their train tickets and submit a P2P review of their classmates’ homework. Hyfer is built using [React.js, JavaScript, HTML, CSS, MySQL and NodeJs].",
            "link": "",
            "sourceCode": "https://github.com/HackYourFuture/hyfer"
        },
        "portfolio": {
            "name": "Portfolio",
            "description": "Is built using: HTML, CSS, JavaScript, VueJs, and Animate.css",
            "link": "",
            "sourceCode": "https://github.com/talalalamdar/portfolio"
        }
    }
}
